In [4]:
# 325p 범주형 데이터
import pandas as pd

values = pd.Series(['apple','orange','apple','apple'] * 2)
pd.unique(valeus)

array(['apple', 'orange'], dtype=object)

In [5]:
# 337p 

pd.get_dummies(values, dtype=float)

   apple  orange
0    1.0     0.0
1    0.0     1.0
2    1.0     0.0
3    1.0     0.0
4    1.0     0.0
5    0.0     1.0
6    1.0     0.0
7    1.0     0.0

In [8]:
# 데이터 붙이기, 늘이기 339

df1 = pd.DataFrame({
    'key' : ['b','b','a','c','a','a','b'],
    'data1':pd.Series(range(7), dtype='Int64')
})
df2 = pd.DataFrame({
    'key':['a', 'b', 'd'],
    'data2': pd.Series(range(3), dtype='Int64')
})

  key  data2
0   a      0
1   b      1
2   d      2

In [9]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [ ]:
pd.merge(df1, df2, on='key')

In [12]:
df3 = pd.DataFrame({'lkey' : ['b','b','a','c','a','a','b'],
                    'data1' : pd.Series(range(7), dtype='Int64')
                   })
df4 = pd.DataFrame({'rkey' : ['a','b','d'],
                    'data1' : pd.Series(range(3), dtype='Int64')
                   })

pd.merge(df3, df4, left_on='lkey', right_on='rkey' )

  lkey  data1_x rkey  data1_y
0    b        0    b        1
1    b        1    b        1
2    b        6    b        1
3    a        2    a        0
4    a        4    a        0
5    a        5    a        0